MikroElektronika/core_packages/PIC/XC8/def/PIC18F448/mcu.h
// Register: RXB1D3
#define RXB1D3 RXB1D3
extern volatile unsigned char           RXB1D3              __at(0xF59);
#ifndef _LIB_BUILD
asm("RXB1D3 equ 0F59h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB1D30                :1;
        unsigned RXB1D31                :1;
        unsigned RXB1D32                :1;
        unsigned RXB1D33                :1;
        unsigned RXB1D34                :1;
        unsigned RXB1D35                :1;
        unsigned RXB1D36                :1;
        unsigned RXB1D37                :1;
    };
} RXB1D3bits_t;
extern volatile RXB1D3bits_t RXB1D3bits __at(0xF59);
// bitfield macros
#define _RXB1D3_RXB1D30_POSN                                0x0
#define _RXB1D3_RXB1D30_POSITION                            0x0
#define _RXB1D3_RXB1D30_SIZE                                0x1
#define _RXB1D3_RXB1D30_LENGTH                              0x1
#define _RXB1D3_RXB1D30_MASK                                0x1
#define _RXB1D3_RXB1D31_POSN                                0x1
#define _RXB1D3_RXB1D31_POSITION                            0x1
#define _RXB1D3_RXB1D31_SIZE                                0x1
#define _RXB1D3_RXB1D31_LENGTH                              0x1
#define _RXB1D3_RXB1D31_MASK                                0x2
#define _RXB1D3_RXB1D32_POSN                                0x2
#define _RXB1D3_RXB1D32_POSITION                            0x2
#define _RXB1D3_RXB1D32_SIZE                                0x1
#define _RXB1D3_RXB1D32_LENGTH                              0x1
#define _RXB1D3_RXB1D32_MASK                                0x4
#define _RXB1D3_RXB1D33_POSN                                0x3
#define _RXB1D3_RXB1D33_POSITION                            0x3
#define _RXB1D3_RXB1D33_SIZE                                0x1
#define _RXB1D3_RXB1D33_LENGTH                              0x1
#define _RXB1D3_RXB1D33_MASK                                0x8
#define _RXB1D3_RXB1D34_POSN                                0x4
#define _RXB1D3_RXB1D34_POSITION                            0x4
#define _RXB1D3_RXB1D34_SIZE                                0x1
#define _RXB1D3_RXB1D34_LENGTH                              0x1
#define _RXB1D3_RXB1D34_MASK                                0x10
#define _RXB1D3_RXB1D35_POSN                                0x5
#define _RXB1D3_RXB1D35_POSITION                            0x5
#define _RXB1D3_RXB1D35_SIZE                                0x1
#define _RXB1D3_RXB1D35_LENGTH                              0x1
#define _RXB1D3_RXB1D35_MASK                                0x20
#define _RXB1D3_RXB1D36_POSN                                0x6
#define _RXB1D3_RXB1D36_POSITION                            0x6
#define _RXB1D3_RXB1D36_SIZE                                0x1
#define _RXB1D3_RXB1D36_LENGTH                              0x1
#define _RXB1D3_RXB1D36_MASK                                0x40
#define _RXB1D3_RXB1D37_POSN                                0x7
#define _RXB1D3_RXB1D37_POSITION                            0x7
#define _RXB1D3_RXB1D37_SIZE                                0x1
#define _RXB1D3_RXB1D37_LENGTH                              0x1
#define _RXB1D3_RXB1D37_MASK                                0x80

// Register: RXB1D4
#define RXB1D4 RXB1D4
extern volatile unsigned char           RXB1D4              __at(0xF5A);
#ifndef _LIB_BUILD
asm("RXB1D4 equ 0F5Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB1D40                :1;
        unsigned RXB1D41                :1;
        unsigned RXB1D42                :1;
        unsigned RXB1D43                :1;
        unsigned RXB1D44                :1;
        unsigned RXB1D45                :1;
        unsigned RXB1D46                :1;
        unsigned RXB1D47                :1;
    };
} RXB1D4bits_t;
extern volatile RXB1D4bits_t RXB1D4bits __at(0xF5A);
// bitfield macros
#define _RXB1D4_RXB1D40_POSN                                0x0
#define _RXB1D4_RXB1D40_POSITION                            0x0
#define _RXB1D4_RXB1D40_SIZE                                0x1
#define _RXB1D4_RXB1D40_LENGTH                              0x1
#define _RXB1D4_RXB1D40_MASK                                0x1
#define _RXB1D4_RXB1D41_POSN                                0x1
#define _RXB1D4_RXB1D41_POSITION                            0x1
#define _RXB1D4_RXB1D41_SIZE                                0x1
#define _RXB1D4_RXB1D41_LENGTH                              0x1
#define _RXB1D4_RXB1D41_MASK                                0x2
#define _RXB1D4_RXB1D42_POSN                                0x2
#define _RXB1D4_RXB1D42_POSITION                            0x2
#define _RXB1D4_RXB1D42_SIZE                                0x1
#define _RXB1D4_RXB1D42_LENGTH                              0x1
#define _RXB1D4_RXB1D42_MASK                                0x4
#define _RXB1D4_RXB1D43_POSN                                0x3
#define _RXB1D4_RXB1D43_POSITION                            0x3
#define _RXB1D4_RXB1D43_SIZE                                0x1
#define _RXB1D4_RXB1D43_LENGTH                              0x1
#define _RXB1D4_RXB1D43_MASK                                0x8
#define _RXB1D4_RXB1D44_POSN                                0x4
#define _RXB1D4_RXB1D44_POSITION                            0x4
#define _RXB1D4_RXB1D44_SIZE                                0x1
#define _RXB1D4_RXB1D44_LENGTH                              0x1
#define _RXB1D4_RXB1D44_MASK                                0x10
#define _RXB1D4_RXB1D45_POSN                                0x5
#define _RXB1D4_RXB1D45_POSITION                            0x5
#define _RXB1D4_RXB1D45_SIZE                                0x1
#define _RXB1D4_RXB1D45_LENGTH                              0x1
#define _RXB1D4_RXB1D45_MASK                                0x20
#define _RXB1D4_RXB1D46_POSN                                0x6
#define _RXB1D4_RXB1D46_POSITION                            0x6
#define _RXB1D4_RXB1D46_SIZE                                0x1
#define _RXB1D4_RXB1D46_LENGTH                              0x1
#define _RXB1D4_RXB1D46_MASK                                0x40
#define _RXB1D4_RXB1D47_POSN                                0x7
#define _RXB1D4_RXB1D47_POSITION                            0x7
#define _RXB1D4_RXB1D47_SIZE                                0x1
#define _RXB1D4_RXB1D47_LENGTH                              0x1
#define _RXB1D4_RXB1D47_MASK                                0x80

// Register: RXB1D5
#define RXB1D5 RXB1D5
extern volatile unsigned char           RXB1D5              __at(0xF5B);
#ifndef _LIB_BUILD
asm("RXB1D5 equ 0F5Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB1D50                :1;
        unsigned RXB1D51                :1;
        unsigned RXB1D52                :1;
        unsigned RXB1D53                :1;
        unsigned RXB1D54                :1;
        unsigned RXB1D55                :1;
        unsigned RXB1D56                :1;
        unsigned RXB1D57                :1;
    };
} RXB1D5bits_t;
extern volatile RXB1D5bits_t RXB1D5bits __at(0xF5B);
// bitfield macros
#define _RXB1D5_RXB1D50_POSN                                0x0
#define _RXB1D5_RXB1D50_POSITION                            0x0
#define _RXB1D5_RXB1D50_SIZE                                0x1
#define _RXB1D5_RXB1D50_LENGTH                              0x1
#define _RXB1D5_RXB1D50_MASK                                0x1
#define _RXB1D5_RXB1D51_POSN                                0x1
#define _RXB1D5_RXB1D51_POSITION                            0x1
#define _RXB1D5_RXB1D51_SIZE                                0x1
#define _RXB1D5_RXB1D51_LENGTH                              0x1
#define _RXB1D5_RXB1D51_MASK                                0x2
#define _RXB1D5_RXB1D52_POSN                                0x2
#define _RXB1D5_RXB1D52_POSITION                            0x2
#define _RXB1D5_RXB1D52_SIZE                                0x1
#define _RXB1D5_RXB1D52_LENGTH                              0x1
#define _RXB1D5_RXB1D52_MASK                                0x4
#define _RXB1D5_RXB1D53_POSN                                0x3
#define _RXB1D5_RXB1D53_POSITION                            0x3
#define _RXB1D5_RXB1D53_SIZE                                0x1
#define _RXB1D5_RXB1D53_LENGTH                              0x1
#define _RXB1D5_RXB1D53_MASK                                0x8
#define _RXB1D5_RXB1D54_POSN                                0x4
#define _RXB1D5_RXB1D54_POSITION                            0x4
#define _RXB1D5_RXB1D54_SIZE                                0x1
#define _RXB1D5_RXB1D54_LENGTH                              0x1
#define _RXB1D5_RXB1D54_MASK                                0x10
#define _RXB1D5_RXB1D55_POSN                                0x5
#define _RXB1D5_RXB1D55_POSITION                            0x5
#define _RXB1D5_RXB1D55_SIZE                                0x1
#define _RXB1D5_RXB1D55_LENGTH                              0x1
#define _RXB1D5_RXB1D55_MASK                                0x20
#define _RXB1D5_RXB1D56_POSN                                0x6
#define _RXB1D5_RXB1D56_POSITION                            0x6
#define _RXB1D5_RXB1D56_SIZE                                0x1
#define _RXB1D5_RXB1D56_LENGTH                              0x1
#define _RXB1D5_RXB1D56_MASK                                0x40
#define _RXB1D5_RXB1D57_POSN                                0x7
#define _RXB1D5_RXB1D57_POSITION                            0x7
#define _RXB1D5_RXB1D57_SIZE                                0x1
#define _RXB1D5_RXB1D57_LENGTH                              0x1
#define _RXB1D5_RXB1D57_MASK                                0x80

// Register: RXB1D6
#define RXB1D6 RXB1D6
extern volatile unsigned char           RXB1D6              __at(0xF5C);
#ifndef _LIB_BUILD
asm("RXB1D6 equ 0F5Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB1D60                :1;
        unsigned RXB1D61                :1;
        unsigned RXB1D62                :1;
        unsigned RXB1D63                :1;
        unsigned RXB1D64                :1;
        unsigned RXB1D65                :1;
        unsigned RXB1D66                :1;
        unsigned RXB1D67                :1;
    };
} RXB1D6bits_t;
extern volatile RXB1D6bits_t RXB1D6bits __at(0xF5C);
// bitfield macros
#define _RXB1D6_RXB1D60_POSN                                0x0
#define _RXB1D6_RXB1D60_POSITION                            0x0
#define _RXB1D6_RXB1D60_SIZE                                0x1
#define _RXB1D6_RXB1D60_LENGTH                              0x1
#define _RXB1D6_RXB1D60_MASK                                0x1
#define _RXB1D6_RXB1D61_POSN                                0x1
#define _RXB1D6_RXB1D61_POSITION                            0x1
#define _RXB1D6_RXB1D61_SIZE                                0x1
#define _RXB1D6_RXB1D61_LENGTH                              0x1
#define _RXB1D6_RXB1D61_MASK                                0x2
#define _RXB1D6_RXB1D62_POSN                                0x2
#define _RXB1D6_RXB1D62_POSITION                            0x2
#define _RXB1D6_RXB1D62_SIZE                                0x1
#define _RXB1D6_RXB1D62_LENGTH                              0x1
#define _RXB1D6_RXB1D62_MASK                                0x4
#define _RXB1D6_RXB1D63_POSN                                0x3
#define _RXB1D6_RXB1D63_POSITION                            0x3
#define _RXB1D6_RXB1D63_SIZE                                0x1
#define _RXB1D6_RXB1D63_LENGTH                              0x1
#define _RXB1D6_RXB1D63_MASK                                0x8
#define _RXB1D6_RXB1D64_POSN                                0x4
#define _RXB1D6_RXB1D64_POSITION                            0x4
#define _RXB1D6_RXB1D64_SIZE                                0x1
#define _RXB1D6_RXB1D64_LENGTH                              0x1
#define _RXB1D6_RXB1D64_MASK                                0x10
#define _RXB1D6_RXB1D65_POSN                                0x5
#define _RXB1D6_RXB1D65_POSITION                            0x5
#define _RXB1D6_RXB1D65_SIZE                                0x1
#define _RXB1D6_RXB1D65_LENGTH                              0x1
#define _RXB1D6_RXB1D65_MASK                                0x20
#define _RXB1D6_RXB1D66_POSN                                0x6
#define _RXB1D6_RXB1D66_POSITION                            0x6
#define _RXB1D6_RXB1D66_SIZE                                0x1
#define _RXB1D6_RXB1D66_LENGTH                              0x1
#define _RXB1D6_RXB1D66_MASK                                0x40
#define _RXB1D6_RXB1D67_POSN                                0x7
#define _RXB1D6_RXB1D67_POSITION                            0x7
#define _RXB1D6_RXB1D67_SIZE                                0x1
#define _RXB1D6_RXB1D67_LENGTH                              0x1
#define _RXB1D6_RXB1D67_MASK                                0x80

// Register: RXB1D7
#define RXB1D7 RXB1D7
extern volatile unsigned char           RXB1D7              __at(0xF5D);
#ifndef _LIB_BUILD
asm("RXB1D7 equ 0F5Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB1D70                :1;
        unsigned RXB1D71                :1;
        unsigned RXB1D72                :1;
        unsigned RXB1D73                :1;
        unsigned RXB1D74                :1;
        unsigned RXB1D75                :1;
        unsigned RXB1D76                :1;
        unsigned RXB1D77                :1;
    };
} RXB1D7bits_t;
