MikroElektronika/core_packages/PIC/XC8/def/PIC18F448/mcu.h
extern volatile __bit                   RXF4EID3            __at(0x789B);	// @ (0xF13 * 8 + 3)
#define                                 RXF4EID3_bit        _BIT_ACCESS(RXF4EIDL,3)
// RXF4EIDL<RXF4EID4>
extern volatile __bit                   RXF4EID4            __at(0x789C);	// @ (0xF13 * 8 + 4)
#define                                 RXF4EID4_bit        _BIT_ACCESS(RXF4EIDL,4)
// RXF4EIDL<RXF4EID5>
extern volatile __bit                   RXF4EID5            __at(0x789D);	// @ (0xF13 * 8 + 5)
#define                                 RXF4EID5_bit        _BIT_ACCESS(RXF4EIDL,5)
// RXF4EIDL<RXF4EID6>
extern volatile __bit                   RXF4EID6            __at(0x789E);	// @ (0xF13 * 8 + 6)
#define                                 RXF4EID6_bit        _BIT_ACCESS(RXF4EIDL,6)
// RXF4EIDL<RXF4EID7>
extern volatile __bit                   RXF4EID7            __at(0x789F);	// @ (0xF13 * 8 + 7)
#define                                 RXF4EID7_bit        _BIT_ACCESS(RXF4EIDL,7)
// RXF4EIDH<RXF4EID8>
extern volatile __bit                   RXF4EID8            __at(0x7890);	// @ (0xF12 * 8 + 0)
#define                                 RXF4EID8_bit        _BIT_ACCESS(RXF4EIDH,0)
// RXF4EIDH<RXF4EID9>
extern volatile __bit                   RXF4EID9            __at(0x7891);	// @ (0xF12 * 8 + 1)
#define                                 RXF4EID9_bit        _BIT_ACCESS(RXF4EIDH,1)
// RXF4SIDL<RXF4EXIDEN>
extern volatile __bit                   RXF4EXIDEN          __at(0x788B);	// @ (0xF11 * 8 + 3)
#define                                 RXF4EXIDEN_bit      _BIT_ACCESS(RXF4SIDL,3)
// RXF4SIDL<RXF4SID0>
extern volatile __bit                   RXF4SID0            __at(0x788D);	// @ (0xF11 * 8 + 5)
#define                                 RXF4SID0_bit        _BIT_ACCESS(RXF4SIDL,5)
// RXF4SIDL<RXF4SID1>
extern volatile __bit                   RXF4SID1            __at(0x788E);	// @ (0xF11 * 8 + 6)
#define                                 RXF4SID1_bit        _BIT_ACCESS(RXF4SIDL,6)
// RXF4SIDH<RXF4SID10>
extern volatile __bit                   RXF4SID10           __at(0x7887);	// @ (0xF10 * 8 + 7)
#define                                 RXF4SID10_bit       _BIT_ACCESS(RXF4SIDH,7)
// RXF4SIDL<RXF4SID2>
extern volatile __bit                   RXF4SID2            __at(0x788F);	// @ (0xF11 * 8 + 7)
#define                                 RXF4SID2_bit        _BIT_ACCESS(RXF4SIDL,7)
// RXF4SIDH<RXF4SID3>
extern volatile __bit                   RXF4SID3            __at(0x7880);	// @ (0xF10 * 8 + 0)
#define                                 RXF4SID3_bit        _BIT_ACCESS(RXF4SIDH,0)
// RXF4SIDH<RXF4SID4>
extern volatile __bit                   RXF4SID4            __at(0x7881);	// @ (0xF10 * 8 + 1)
#define                                 RXF4SID4_bit        _BIT_ACCESS(RXF4SIDH,1)
// RXF4SIDH<RXF4SID5>
extern volatile __bit                   RXF4SID5            __at(0x7882);	// @ (0xF10 * 8 + 2)
#define                                 RXF4SID5_bit        _BIT_ACCESS(RXF4SIDH,2)
// RXF4SIDH<RXF4SID6>
extern volatile __bit                   RXF4SID6            __at(0x7883);	// @ (0xF10 * 8 + 3)
#define                                 RXF4SID6_bit        _BIT_ACCESS(RXF4SIDH,3)
// RXF4SIDH<RXF4SID7>
extern volatile __bit                   RXF4SID7            __at(0x7884);	// @ (0xF10 * 8 + 4)
#define                                 RXF4SID7_bit        _BIT_ACCESS(RXF4SIDH,4)
// RXF4SIDH<RXF4SID8>
extern volatile __bit                   RXF4SID8            __at(0x7885);	// @ (0xF10 * 8 + 5)
#define                                 RXF4SID8_bit        _BIT_ACCESS(RXF4SIDH,5)
// RXF4SIDH<RXF4SID9>
extern volatile __bit                   RXF4SID9            __at(0x7886);	// @ (0xF10 * 8 + 6)
#define                                 RXF4SID9_bit        _BIT_ACCESS(RXF4SIDH,6)
// RXF5EIDL<RXF5EID0>
extern volatile __bit                   RXF5EID0            __at(0x78B8);	// @ (0xF17 * 8 + 0)
#define                                 RXF5EID0_bit        _BIT_ACCESS(RXF5EIDL,0)
// RXF5EIDL<RXF5EID1>
extern volatile __bit                   RXF5EID1            __at(0x78B9);	// @ (0xF17 * 8 + 1)
#define                                 RXF5EID1_bit        _BIT_ACCESS(RXF5EIDL,1)
// RXF5EIDH<RXF5EID10>
extern volatile __bit                   RXF5EID10           __at(0x78B2);	// @ (0xF16 * 8 + 2)
#define                                 RXF5EID10_bit       _BIT_ACCESS(RXF5EIDH,2)
// RXF5EIDH<RXF5EID11>
extern volatile __bit                   RXF5EID11           __at(0x78B3);	// @ (0xF16 * 8 + 3)
#define                                 RXF5EID11_bit       _BIT_ACCESS(RXF5EIDH,3)
// RXF5EIDH<RXF5EID12>
extern volatile __bit                   RXF5EID12           __at(0x78B4);	// @ (0xF16 * 8 + 4)
#define                                 RXF5EID12_bit       _BIT_ACCESS(RXF5EIDH,4)
// RXF5EIDH<RXF5EID13>
extern volatile __bit                   RXF5EID13           __at(0x78B5);	// @ (0xF16 * 8 + 5)
#define                                 RXF5EID13_bit       _BIT_ACCESS(RXF5EIDH,5)
// RXF5EIDH<RXF5EID14>
extern volatile __bit                   RXF5EID14           __at(0x78B6);	// @ (0xF16 * 8 + 6)
#define                                 RXF5EID14_bit       _BIT_ACCESS(RXF5EIDH,6)
// RXF5EIDH<RXF5EID15>
extern volatile __bit                   RXF5EID15           __at(0x78B7);	// @ (0xF16 * 8 + 7)
#define                                 RXF5EID15_bit       _BIT_ACCESS(RXF5EIDH,7)
// RXF5SIDL<RXF5EID16>
extern volatile __bit                   RXF5EID16           __at(0x78A8);	// @ (0xF15 * 8 + 0)
#define                                 RXF5EID16_bit       _BIT_ACCESS(RXF5SIDL,0)
// RXF5SIDL<RXF5EID17>
extern volatile __bit                   RXF5EID17           __at(0x78A9);	// @ (0xF15 * 8 + 1)
#define                                 RXF5EID17_bit       _BIT_ACCESS(RXF5SIDL,1)
// RXF5EIDL<RXF5EID2>
extern volatile __bit                   RXF5EID2            __at(0x78BA);	// @ (0xF17 * 8 + 2)
#define                                 RXF5EID2_bit        _BIT_ACCESS(RXF5EIDL,2)
// RXF5EIDL<RXF5EID3>
extern volatile __bit                   RXF5EID3            __at(0x78BB);	// @ (0xF17 * 8 + 3)
#define                                 RXF5EID3_bit        _BIT_ACCESS(RXF5EIDL,3)
// RXF5EIDL<RXF5EID4>
extern volatile __bit                   RXF5EID4            __at(0x78BC);	// @ (0xF17 * 8 + 4)
#define                                 RXF5EID4_bit        _BIT_ACCESS(RXF5EIDL,4)
// RXF5EIDL<RXF5EID5>
extern volatile __bit                   RXF5EID5            __at(0x78BD);	// @ (0xF17 * 8 + 5)
#define                                 RXF5EID5_bit        _BIT_ACCESS(RXF5EIDL,5)
// RXF5EIDL<RXF5EID6>
extern volatile __bit                   RXF5EID6            __at(0x78BE);	// @ (0xF17 * 8 + 6)
#define                                 RXF5EID6_bit        _BIT_ACCESS(RXF5EIDL,6)
// RXF5EIDL<RXF5EID7>
extern volatile __bit                   RXF5EID7            __at(0x78BF);	// @ (0xF17 * 8 + 7)
#define                                 RXF5EID7_bit        _BIT_ACCESS(RXF5EIDL,7)
// RXF5EIDH<RXF5EID8>
extern volatile __bit                   RXF5EID8            __at(0x78B0);	// @ (0xF16 * 8 + 0)
#define                                 RXF5EID8_bit        _BIT_ACCESS(RXF5EIDH,0)
// RXF5EIDH<RXF5EID9>
extern volatile __bit                   RXF5EID9            __at(0x78B1);	// @ (0xF16 * 8 + 1)
#define                                 RXF5EID9_bit        _BIT_ACCESS(RXF5EIDH,1)
// RXF5SIDL<RXF5EXIDEN>
extern volatile __bit                   RXF5EXIDEN          __at(0x78AB);	// @ (0xF15 * 8 + 3)
#define                                 RXF5EXIDEN_bit      _BIT_ACCESS(RXF5SIDL,3)
// RXF5SIDL<RXF5SID0>
extern volatile __bit                   RXF5SID0            __at(0x78AD);	// @ (0xF15 * 8 + 5)
#define                                 RXF5SID0_bit        _BIT_ACCESS(RXF5SIDL,5)
// RXF5SIDL<RXF5SID1>
extern volatile __bit                   RXF5SID1            __at(0x78AE);	// @ (0xF15 * 8 + 6)
#define                                 RXF5SID1_bit        _BIT_ACCESS(RXF5SIDL,6)
// RXF5SIDH<RXF5SID10>
extern volatile __bit                   RXF5SID10           __at(0x78A7);	// @ (0xF14 * 8 + 7)
#define                                 RXF5SID10_bit       _BIT_ACCESS(RXF5SIDH,7)
// RXF5SIDL<RXF5SID2>
extern volatile __bit                   RXF5SID2            __at(0x78AF);	// @ (0xF15 * 8 + 7)
#define                                 RXF5SID2_bit        _BIT_ACCESS(RXF5SIDL,7)
// RXF5SIDH<RXF5SID3>
extern volatile __bit                   RXF5SID3            __at(0x78A0);	// @ (0xF14 * 8 + 0)
#define                                 RXF5SID3_bit        _BIT_ACCESS(RXF5SIDH,0)
// RXF5SIDH<RXF5SID4>
extern volatile __bit                   RXF5SID4            __at(0x78A1);	// @ (0xF14 * 8 + 1)
#define                                 RXF5SID4_bit        _BIT_ACCESS(RXF5SIDH,1)
// RXF5SIDH<RXF5SID5>
extern volatile __bit                   RXF5SID5            __at(0x78A2);	// @ (0xF14 * 8 + 2)
#define                                 RXF5SID5_bit        _BIT_ACCESS(RXF5SIDH,2)
// RXF5SIDH<RXF5SID6>
extern volatile __bit                   RXF5SID6            __at(0x78A3);	// @ (0xF14 * 8 + 3)
#define                                 RXF5SID6_bit        _BIT_ACCESS(RXF5SIDH,3)
// RXF5SIDH<RXF5SID7>
extern volatile __bit                   RXF5SID7            __at(0x78A4);	// @ (0xF14 * 8 + 4)
#define                                 RXF5SID7_bit        _BIT_ACCESS(RXF5SIDH,4)
// RXF5SIDH<RXF5SID8>
extern volatile __bit                   RXF5SID8            __at(0x78A5);	// @ (0xF14 * 8 + 5)
#define                                 RXF5SID8_bit        _BIT_ACCESS(RXF5SIDH,5)
// RXF5SIDH<RXF5SID9>
extern volatile __bit                   RXF5SID9            __at(0x78A6);	// @ (0xF14 * 8 + 6)
#define                                 RXF5SID9_bit        _BIT_ACCESS(RXF5SIDH,6)
// RXM0EIDL<RXM0EID0>
extern volatile __bit                   RXM0EID0            __at(0x78D8);	// @ (0xF1B * 8 + 0)
#define                                 RXM0EID0_bit        _BIT_ACCESS(RXM0EIDL,0)
// RXM0EIDL<RXM0EID1>
extern volatile __bit                   RXM0EID1            __at(0x78D9);	// @ (0xF1B * 8 + 1)
#define                                 RXM0EID1_bit        _BIT_ACCESS(RXM0EIDL,1)
// RXM0EIDH<RXM0EID10>
extern volatile __bit                   RXM0EID10           __at(0x78D2);	// @ (0xF1A * 8 + 2)
#define                                 RXM0EID10_bit       _BIT_ACCESS(RXM0EIDH,2)
// RXM0EIDH<RXM0EID11>
extern volatile __bit                   RXM0EID11           __at(0x78D3);	// @ (0xF1A * 8 + 3)
#define                                 RXM0EID11_bit       _BIT_ACCESS(RXM0EIDH,3)
// RXM0EIDH<RXM0EID12>
extern volatile __bit                   RXM0EID12           __at(0x78D4);	// @ (0xF1A * 8 + 4)
#define                                 RXM0EID12_bit       _BIT_ACCESS(RXM0EIDH,4)
// RXM0EIDH<RXM0EID13>
extern volatile __bit                   RXM0EID13           __at(0x78D5);	// @ (0xF1A * 8 + 5)
#define                                 RXM0EID13_bit       _BIT_ACCESS(RXM0EIDH,5)
// RXM0EIDH<RXM0EID14>
extern volatile __bit                   RXM0EID14           __at(0x78D6);	// @ (0xF1A * 8 + 6)
#define                                 RXM0EID14_bit       _BIT_ACCESS(RXM0EIDH,6)
// RXM0EIDH<RXM0EID15>
extern volatile __bit                   RXM0EID15           __at(0x78D7);	// @ (0xF1A * 8 + 7)
#define                                 RXM0EID15_bit       _BIT_ACCESS(RXM0EIDH,7)
// RXM0SIDL<RXM0EID16>
extern volatile __bit                   RXM0EID16           __at(0x78C8);	// @ (0xF19 * 8 + 0)
#define                                 RXM0EID16_bit       _BIT_ACCESS(RXM0SIDL,0)
// RXM0SIDL<RXM0EID17>
extern volatile __bit                   RXM0EID17           __at(0x78C9);	// @ (0xF19 * 8 + 1)
#define                                 RXM0EID17_bit       _BIT_ACCESS(RXM0SIDL,1)
// RXM0EIDL<RXM0EID2>
extern volatile __bit                   RXM0EID2            __at(0x78DA);	// @ (0xF1B * 8 + 2)
#define                                 RXM0EID2_bit        _BIT_ACCESS(RXM0EIDL,2)
// RXM0EIDL<RXM0EID3>
extern volatile __bit                   RXM0EID3            __at(0x78DB);	// @ (0xF1B * 8 + 3)
#define                                 RXM0EID3_bit        _BIT_ACCESS(RXM0EIDL,3)
// RXM0EIDL<RXM0EID4>
extern volatile __bit                   RXM0EID4            __at(0x78DC);	// @ (0xF1B * 8 + 4)
#define                                 RXM0EID4_bit        _BIT_ACCESS(RXM0EIDL,4)
// RXM0EIDL<RXM0EID5>
extern volatile __bit                   RXM0EID5            __at(0x78DD);	// @ (0xF1B * 8 + 5)
#define                                 RXM0EID5_bit        _BIT_ACCESS(RXM0EIDL,5)
// RXM0EIDL<RXM0EID6>
extern volatile __bit                   RXM0EID6            __at(0x78DE);	// @ (0xF1B * 8 + 6)
#define                                 RXM0EID6_bit        _BIT_ACCESS(RXM0EIDL,6)
// RXM0EIDL<RXM0EID7>
extern volatile __bit                   RXM0EID7            __at(0x78DF);	// @ (0xF1B * 8 + 7)
#define                                 RXM0EID7_bit        _BIT_ACCESS(RXM0EIDL,7)
// RXM0EIDH<RXM0EID8>
extern volatile __bit                   RXM0EID8            __at(0x78D0);	// @ (0xF1A * 8 + 0)
#define                                 RXM0EID8_bit        _BIT_ACCESS(RXM0EIDH,0)
// RXM0EIDH<RXM0EID9>
extern volatile __bit                   RXM0EID9            __at(0x78D1);	// @ (0xF1A * 8 + 1)
#define                                 RXM0EID9_bit        _BIT_ACCESS(RXM0EIDH,1)
// RXM0SIDL<RXM0SID0>
extern volatile __bit                   RXM0SID0            __at(0x78CD);	// @ (0xF19 * 8 + 5)
#define                                 RXM0SID0_bit        _BIT_ACCESS(RXM0SIDL,5)
// RXM0SIDL<RXM0SID1>
extern volatile __bit                   RXM0SID1            __at(0x78CE);	// @ (0xF19 * 8 + 6)
#define                                 RXM0SID1_bit        _BIT_ACCESS(RXM0SIDL,6)
// RXM0SIDH<RXM0SID10>
extern volatile __bit                   RXM0SID10           __at(0x78C7);	// @ (0xF18 * 8 + 7)
#define                                 RXM0SID10_bit       _BIT_ACCESS(RXM0SIDH,7)
// RXM0SIDL<RXM0SID2>
extern volatile __bit                   RXM0SID2            __at(0x78CF);	// @ (0xF19 * 8 + 7)
#define                                 RXM0SID2_bit        _BIT_ACCESS(RXM0SIDL,7)
// RXM0SIDH<RXM0SID3>
extern volatile __bit                   RXM0SID3            __at(0x78C0);	// @ (0xF18 * 8 + 0)
#define                                 RXM0SID3_bit        _BIT_ACCESS(RXM0SIDH,0)
// RXM0SIDH<RXM0SID4>
extern volatile __bit                   RXM0SID4            __at(0x78C1);	// @ (0xF18 * 8 + 1)
#define                                 RXM0SID4_bit        _BIT_ACCESS(RXM0SIDH,1)
// RXM0SIDH<RXM0SID5>
extern volatile __bit                   RXM0SID5            __at(0x78C2);	// @ (0xF18 * 8 + 2)
#define                                 RXM0SID5_bit        _BIT_ACCESS(RXM0SIDH,2)
// RXM0SIDH<RXM0SID6>
extern volatile __bit                   RXM0SID6            __at(0x78C3);	// @ (0xF18 * 8 + 3)
#define                                 RXM0SID6_bit        _BIT_ACCESS(RXM0SIDH,3)
// RXM0SIDH<RXM0SID7>
extern volatile __bit                   RXM0SID7            __at(0x78C4);	// @ (0xF18 * 8 + 4)
#define                                 RXM0SID7_bit        _BIT_ACCESS(RXM0SIDH,4)
// RXM0SIDH<RXM0SID8>
extern volatile __bit                   RXM0SID8            __at(0x78C5);	// @ (0xF18 * 8 + 5)
#define                                 RXM0SID8_bit        _BIT_ACCESS(RXM0SIDH,5)
// RXM0SIDH<RXM0SID9>
extern volatile __bit                   RXM0SID9            __at(0x78C6);	// @ (0xF18 * 8 + 6)
#define                                 RXM0SID9_bit        _BIT_ACCESS(RXM0SIDH,6)
// RXM1EIDL<RXM1EID0>
extern volatile __bit                   RXM1EID0            __at(0x78F8);	// @ (0xF1F * 8 + 0)
#define                                 RXM1EID0_bit        _BIT_ACCESS(RXM1EIDL,0)
// RXM1EIDL<RXM1EID1>
extern volatile __bit                   RXM1EID1            __at(0x78F9);	// @ (0xF1F * 8 + 1)
#define                                 RXM1EID1_bit        _BIT_ACCESS(RXM1EIDL,1)
// RXM1EIDH<RXM1EID10>
extern volatile __bit                   RXM1EID10           __at(0x78F2);	// @ (0xF1E * 8 + 2)
#define                                 RXM1EID10_bit       _BIT_ACCESS(RXM1EIDH,2)
// RXM1EIDH<RXM1EID11>
extern volatile __bit                   RXM1EID11           __at(0x78F3);	// @ (0xF1E * 8 + 3)
#define                                 RXM1EID11_bit       _BIT_ACCESS(RXM1EIDH,3)
// RXM1EIDH<RXM1EID12>
extern volatile __bit                   RXM1EID12           __at(0x78F4);	// @ (0xF1E * 8 + 4)
#define                                 RXM1EID12_bit       _BIT_ACCESS(RXM1EIDH,4)
// RXM1EIDH<RXM1EID13>
extern volatile __bit                   RXM1EID13           __at(0x78F5);	// @ (0xF1E * 8 + 5)
#define                                 RXM1EID13_bit       _BIT_ACCESS(RXM1EIDH,5)
// RXM1EIDH<RXM1EID14>
extern volatile __bit                   RXM1EID14           __at(0x78F6);	// @ (0xF1E * 8 + 6)
#define                                 RXM1EID14_bit       _BIT_ACCESS(RXM1EIDH,6)
// RXM1EIDH<RXM1EID15>
extern volatile __bit                   RXM1EID15           __at(0x78F7);	// @ (0xF1E * 8 + 7)
#define                                 RXM1EID15_bit       _BIT_ACCESS(RXM1EIDH,7)
// RXM1SIDL<RXM1EID16>
extern volatile __bit                   RXM1EID16           __at(0x78E8);	// @ (0xF1D * 8 + 0)
#define                                 RXM1EID16_bit       _BIT_ACCESS(RXM1SIDL,0)
// RXM1SIDL<RXM1EID17>
extern volatile __bit                   RXM1EID17           __at(0x78E9);	// @ (0xF1D * 8 + 1)
#define                                 RXM1EID17_bit       _BIT_ACCESS(RXM1SIDL,1)
// RXM1EIDL<RXM1EID2>
extern volatile __bit                   RXM1EID2            __at(0x78FA);	// @ (0xF1F * 8 + 2)
#define                                 RXM1EID2_bit        _BIT_ACCESS(RXM1EIDL,2)
// RXM1EIDL<RXM1EID3>
extern volatile __bit                   RXM1EID3            __at(0x78FB);	// @ (0xF1F * 8 + 3)
#define                                 RXM1EID3_bit        _BIT_ACCESS(RXM1EIDL,3)
// RXM1EIDL<RXM1EID4>
extern volatile __bit                   RXM1EID4            __at(0x78FC);	// @ (0xF1F * 8 + 4)
#define                                 RXM1EID4_bit        _BIT_ACCESS(RXM1EIDL,4)
// RXM1EIDL<RXM1EID5>
extern volatile __bit                   RXM1EID5            __at(0x78FD);	// @ (0xF1F * 8 + 5)
#define                                 RXM1EID5_bit        _BIT_ACCESS(RXM1EIDL,5)
// RXM1EIDL<RXM1EID6>
extern volatile __bit                   RXM1EID6            __at(0x78FE);	// @ (0xF1F * 8 + 6)
#define                                 RXM1EID6_bit        _BIT_ACCESS(RXM1EIDL,6)
// RXM1EIDL<RXM1EID7>
extern volatile __bit                   RXM1EID7            __at(0x78FF);	// @ (0xF1F * 8 + 7)
#define                                 RXM1EID7_bit        _BIT_ACCESS(RXM1EIDL,7)
// RXM1EIDH<RXM1EID8>
extern volatile __bit                   RXM1EID8            __at(0x78F0);	// @ (0xF1E * 8 + 0)
#define                                 RXM1EID8_bit        _BIT_ACCESS(RXM1EIDH,0)
// RXM1EIDH<RXM1EID9>
extern volatile __bit                   RXM1EID9            __at(0x78F1);	// @ (0xF1E * 8 + 1)
#define                                 RXM1EID9_bit        _BIT_ACCESS(RXM1EIDH,1)
// RXM1SIDL<RXM1SID0>
extern volatile __bit                   RXM1SID0            __at(0x78ED);	// @ (0xF1D * 8 + 5)
#define                                 RXM1SID0_bit        _BIT_ACCESS(RXM1SIDL,5)
// RXM1SIDL<RXM1SID1>
extern volatile __bit                   RXM1SID1            __at(0x78EE);	// @ (0xF1D * 8 + 6)
#define                                 RXM1SID1_bit        _BIT_ACCESS(RXM1SIDL,6)
// RXM1SIDH<RXM1SID10>
extern volatile __bit                   RXM1SID10           __at(0x78E7);	// @ (0xF1C * 8 + 7)
#define                                 RXM1SID10_bit       _BIT_ACCESS(RXM1SIDH,7)
// RXM1SIDL<RXM1SID2>
extern volatile __bit                   RXM1SID2            __at(0x78EF);	// @ (0xF1D * 8 + 7)
#define                                 RXM1SID2_bit        _BIT_ACCESS(RXM1SIDL,7)
// RXM1SIDH<RXM1SID3>
extern volatile __bit                   RXM1SID3            __at(0x78E0);	// @ (0xF1C * 8 + 0)
#define                                 RXM1SID3_bit        _BIT_ACCESS(RXM1SIDH,0)
// RXM1SIDH<RXM1SID4>
extern volatile __bit                   RXM1SID4            __at(0x78E1);	// @ (0xF1C * 8 + 1)
#define                                 RXM1SID4_bit        _BIT_ACCESS(RXM1SIDH,1)
// RXM1SIDH<RXM1SID5>
extern volatile __bit                   RXM1SID5            __at(0x78E2);	// @ (0xF1C * 8 + 2)
#define                                 RXM1SID5_bit        _BIT_ACCESS(RXM1SIDH,2)
// RXM1SIDH<RXM1SID6>
extern volatile __bit                   RXM1SID6            __at(0x78E3);	// @ (0xF1C * 8 + 3)
#define                                 RXM1SID6_bit        _BIT_ACCESS(RXM1SIDH,3)
// RXM1SIDH<RXM1SID7>
extern volatile __bit                   RXM1SID7            __at(0x78E4);	// @ (0xF1C * 8 + 4)
#define                                 RXM1SID7_bit        _BIT_ACCESS(RXM1SIDH,4)
// RXM1SIDH<RXM1SID8>
extern volatile __bit                   RXM1SID8            __at(0x78E5);	// @ (0xF1C * 8 + 5)
#define                                 RXM1SID8_bit        _BIT_ACCESS(RXM1SIDH,5)
// RXM1SIDH<RXM1SID9>
extern volatile __bit                   RXM1SID9            __at(0x78E6);	// @ (0xF1C * 8 + 6)
#define                                 RXM1SID9_bit        _BIT_ACCESS(RXM1SIDH,6)
// COMSTAT<RXWARN>
extern volatile __bit                   RXWARN              __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 RXWARN_bit          _BIT_ACCESS(COMSTAT,1)
// SSPSTAT<R_NOT_W>
extern volatile __bit                   R_NOT_W             __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_NOT_W_bit         _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_W>
extern volatile __bit                   R_W                 __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_W_bit             _BIT_ACCESS(SSPSTAT,2)
// SSPSTAT<R_nW>
extern volatile __bit                   R_nW                __at(0x7E3A);	// @ (0xFC7 * 8 + 2)
#define                                 R_nW_bit            _BIT_ACCESS(SSPSTAT,2)
// BRGCON2<SAM>
extern volatile __bit                   SAM                 __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 SAM_bit             _BIT_ACCESS(BRGCON2,6)
// PORTC<SCK>
extern volatile __bit                   SCK                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCK_bit             _BIT_ACCESS(PORTC,3)
// PORTC<SCL>
extern volatile __bit                   SCL                 __at(0x7C13);	// @ (0xF82 * 8 + 3)
#define                                 SCL_bit             _BIT_ACCESS(PORTC,3)
// OSCCON<SCS>
extern volatile __bit                   SCS                 __at(0x7E98);	// @ (0xFD3 * 8 + 0)
#define                                 SCS_bit             _BIT_ACCESS(OSCCON,0)
// PORTC<SDA>
extern volatile __bit                   SDA                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDA_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDI>
extern volatile __bit                   SDI                 __at(0x7C14);	// @ (0xF82 * 8 + 4)
#define                                 SDI_bit             _BIT_ACCESS(PORTC,4)
// PORTC<SDO>
extern volatile __bit                   SDO                 __at(0x7C15);	// @ (0xF82 * 8 + 5)
#define                                 SDO_bit             _BIT_ACCESS(PORTC,5)
// BRGCON2<SEG1PH0>
extern volatile __bit                   SEG1PH0             __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 SEG1PH0_bit         _BIT_ACCESS(BRGCON2,3)
// BRGCON2<SEG1PH1>
extern volatile __bit                   SEG1PH1             __at(0x7B8C);	// @ (0xF71 * 8 + 4)
